grevaillot/svd_tools/headers/ATSAMV71Q19/mcan1.h
#define MCAN1_MCAN_RXF0C_F0WM_SHIFT		24
#define MCAN1_MCAN_RXF0C_F0WM_MASK		0x7f
/** @defgroup mcan1_mcan_rxf0c_f0wm F0WM Receive FIFO 0 Watermark
@{*/
/**@}*/


#define MCAN1_MCAN_RXF0C_F0S_SHIFT		16
#define MCAN1_MCAN_RXF0C_F0S_MASK		0x7f
/** @defgroup mcan1_mcan_rxf0c_f0s F0S Receive FIFO 0 Start Address
@{*/
/**@}*/


#define MCAN1_MCAN_RXF0C_F0SA_SHIFT		2
#define MCAN1_MCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup mcan1_mcan_rxf0c_f0sa F0SA Receive FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxf0s MCANRXF0S Receive FIFO 0 Status Register
@{*/

/** MCAN1_MCAN_RXF0S_RF0L Receive FIFO 0 Message Lost **/
#define MCAN1_MCAN_RXF0S_RF0L		(1 << 25)
/** MCAN1_MCAN_RXF0S_F0F Receive FIFO 0 Fill Level **/
#define MCAN1_MCAN_RXF0S_F0F		(1 << 24)

#define MCAN1_MCAN_RXF0S_F0PI_SHIFT		16
#define MCAN1_MCAN_RXF0S_F0PI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf0s_f0pi F0PI Receive FIFO 0 Put Index
@{*/
/**@}*/


#define MCAN1_MCAN_RXF0S_F0GI_SHIFT		8
#define MCAN1_MCAN_RXF0S_F0GI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf0s_f0gi F0GI Receive FIFO 0 Get Index
@{*/
/**@}*/


#define MCAN1_MCAN_RXF0S_F0FL_SHIFT		0
#define MCAN1_MCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup mcan1_mcan_rxf0s_f0fl F0FL Receive FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxf0a MCANRXF0A Receive FIFO 0 Acknowledge Register
@{*/


#define MCAN1_MCAN_RXF0A_F0AI_SHIFT		0
#define MCAN1_MCAN_RXF0A_F0AI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf0a_f0ai F0AI Receive FIFO 0 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxbc MCANRXBC Receive Rx Buffer Configuration Register
@{*/


#define MCAN1_MCAN_RXBC_RBSA_SHIFT		2
#define MCAN1_MCAN_RXBC_RBSA_MASK		0x3fff
/** @defgroup mcan1_mcan_rxbc_rbsa RBSA Receive Buffer Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxf1c MCANRXF1C Receive FIFO 1 Configuration Register
@{*/

/** MCAN1_MCAN_RXF1C_F1OM FIFO 1 Operation Mode **/
#define MCAN1_MCAN_RXF1C_F1OM		(1 << 31)

#define MCAN1_MCAN_RXF1C_F1WM_SHIFT		24
#define MCAN1_MCAN_RXF1C_F1WM_MASK		0x7f
/** @defgroup mcan1_mcan_rxf1c_f1wm F1WM Receive FIFO 1 Watermark
@{*/
/**@}*/


#define MCAN1_MCAN_RXF1C_F1S_SHIFT		16
#define MCAN1_MCAN_RXF1C_F1S_MASK		0x7f
/** @defgroup mcan1_mcan_rxf1c_f1s F1S Receive FIFO 1 Start Address
@{*/
/**@}*/


#define MCAN1_MCAN_RXF1C_F1SA_SHIFT		2
#define MCAN1_MCAN_RXF1C_F1SA_MASK		0x3fff
/** @defgroup mcan1_mcan_rxf1c_f1sa F1SA Receive FIFO 1 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxf1s MCANRXF1S Receive FIFO 1 Status Register
@{*/


#define MCAN1_MCAN_RXF1S_DMS_SHIFT		30
#define MCAN1_MCAN_RXF1S_DMS_MASK		0x03
/** @defgroup mcan1_mcan_rxf1s_dms DMS Debug Message Status
@{*/
/**@}*/

/** MCAN1_MCAN_RXF1S_RF1L Receive FIFO 1 Message Lost **/
#define MCAN1_MCAN_RXF1S_RF1L		(1 << 25)
/** MCAN1_MCAN_RXF1S_F1F Receive FIFO 1 Fill Level **/
#define MCAN1_MCAN_RXF1S_F1F		(1 << 24)

#define MCAN1_MCAN_RXF1S_F1PI_SHIFT		16
#define MCAN1_MCAN_RXF1S_F1PI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf1s_f1pi F1PI Receive FIFO 1 Put Index
@{*/
/**@}*/


#define MCAN1_MCAN_RXF1S_F1GI_SHIFT		8
#define MCAN1_MCAN_RXF1S_F1GI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf1s_f1gi F1GI Receive FIFO 1 Get Index
@{*/
/**@}*/


#define MCAN1_MCAN_RXF1S_F1FL_SHIFT		0
#define MCAN1_MCAN_RXF1S_F1FL_MASK		0x7f
/** @defgroup mcan1_mcan_rxf1s_f1fl F1FL Receive FIFO 1 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxf1a MCANRXF1A Receive FIFO 1 Acknowledge Register
@{*/


#define MCAN1_MCAN_RXF1A_F1AI_SHIFT		0
#define MCAN1_MCAN_RXF1A_F1AI_MASK		0x3f
/** @defgroup mcan1_mcan_rxf1a_f1ai F1AI Receive FIFO 1 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_rxesc MCANRXESC Receive Buffer / FIFO Element Size Configuration Register
@{*/


#define MCAN1_MCAN_RXESC_RBDS_SHIFT		8
#define MCAN1_MCAN_RXESC_RBDS_MASK		0x07
/** @defgroup mcan1_mcan_rxesc_rbds RBDS Receive Buffer Data Field Size
@{*/
/**@}*/


#define MCAN1_MCAN_RXESC_F1DS_SHIFT		4
#define MCAN1_MCAN_RXESC_F1DS_MASK		0x07
/** @defgroup mcan1_mcan_rxesc_f1ds F1DS Receive FIFO 1 Data Field Size
@{*/
/**@}*/


#define MCAN1_MCAN_RXESC_F0DS_SHIFT		0
#define MCAN1_MCAN_RXESC_F0DS_MASK		0x07
/** @defgroup mcan1_mcan_rxesc_f0ds F0DS Receive FIFO 0 Data Field Size
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_txbc MCANTXBC Transmit Buffer Configuration Register
@{*/

/** MCAN1_MCAN_TXBC_TFQM Tx FIFO/Queue Mode **/
#define MCAN1_MCAN_TXBC_TFQM		(1 << 30)

#define MCAN1_MCAN_TXBC_TFQS_SHIFT		24
#define MCAN1_MCAN_TXBC_TFQS_MASK		0x3f
/** @defgroup mcan1_mcan_txbc_tfqs TFQS Transmit FIFO/Queue Size
@{*/
/**@}*/


#define MCAN1_MCAN_TXBC_NDTB_SHIFT		16
#define MCAN1_MCAN_TXBC_NDTB_MASK		0x3f
/** @defgroup mcan1_mcan_txbc_ndtb NDTB Number of Dedicated Transmit Buffers
@{*/
/**@}*/


#define MCAN1_MCAN_TXBC_TBSA_SHIFT		2
#define MCAN1_MCAN_TXBC_TBSA_MASK		0x3fff
/** @defgroup mcan1_mcan_txbc_tbsa TBSA Tx Buffers Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_txfqs MCANTXFQS Transmit FIFO/Queue Status Register
@{*/

/** MCAN1_MCAN_TXFQS_TFQF Tx FIFO/Queue Full **/
#define MCAN1_MCAN_TXFQS_TFQF		(1 << 21)

#define MCAN1_MCAN_TXFQS_TFQPI_SHIFT		16
#define MCAN1_MCAN_TXFQS_TFQPI_MASK		0x1f
/** @defgroup mcan1_mcan_txfqs_tfqpi TFQPI Tx FIFO/Queue Put Index
@{*/
/**@}*/


#define MCAN1_MCAN_TXFQS_TFGI_SHIFT		8
#define MCAN1_MCAN_TXFQS_TFGI_MASK		0x1f
/** @defgroup mcan1_mcan_txfqs_tfgi TFGI Tx FIFO Get Index
@{*/
/**@}*/


#define MCAN1_MCAN_TXFQS_TFFL_SHIFT		0
#define MCAN1_MCAN_TXFQS_TFFL_MASK		0x3f
/** @defgroup mcan1_mcan_txfqs_tffl TFFL Tx FIFO Free Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_txesc MCANTXESC Transmit Buffer Element Size Configuration Register
@{*/


#define MCAN1_MCAN_TXESC_TBDS_SHIFT		0
#define MCAN1_MCAN_TXESC_TBDS_MASK		0x07
/** @defgroup mcan1_mcan_txesc_tbds TBDS Tx Buffer Data Field Size
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_txbrp MCANTXBRP Transmit Buffer Request Pending Register
@{*/

/** MCAN1_MCAN_TXBRP_TRP31 Transmission Request Pending for Buffer 31 **/
#define MCAN1_MCAN_TXBRP_TRP31		(1 << 31)
/** MCAN1_MCAN_TXBRP_TRP30 Transmission Request Pending for Buffer 30 **/
#define MCAN1_MCAN_TXBRP_TRP30		(1 << 30)
/** MCAN1_MCAN_TXBRP_TRP29 Transmission Request Pending for Buffer 29 **/
#define MCAN1_MCAN_TXBRP_TRP29		(1 << 29)
/** MCAN1_MCAN_TXBRP_TRP28 Transmission Request Pending for Buffer 28 **/
#define MCAN1_MCAN_TXBRP_TRP28		(1 << 28)
/** MCAN1_MCAN_TXBRP_TRP27 Transmission Request Pending for Buffer 27 **/
#define MCAN1_MCAN_TXBRP_TRP27		(1 << 27)
/** MCAN1_MCAN_TXBRP_TRP26 Transmission Request Pending for Buffer 26 **/
#define MCAN1_MCAN_TXBRP_TRP26		(1 << 26)
/** MCAN1_MCAN_TXBRP_TRP25 Transmission Request Pending for Buffer 25 **/
#define MCAN1_MCAN_TXBRP_TRP25		(1 << 25)
/** MCAN1_MCAN_TXBRP_TRP24 Transmission Request Pending for Buffer 24 **/
#define MCAN1_MCAN_TXBRP_TRP24		(1 << 24)
/** MCAN1_MCAN_TXBRP_TRP23 Transmission Request Pending for Buffer 23 **/
#define MCAN1_MCAN_TXBRP_TRP23		(1 << 23)
/** MCAN1_MCAN_TXBRP_TRP22 Transmission Request Pending for Buffer 22 **/
#define MCAN1_MCAN_TXBRP_TRP22		(1 << 22)
/** MCAN1_MCAN_TXBRP_TRP21 Transmission Request Pending for Buffer 21 **/
#define MCAN1_MCAN_TXBRP_TRP21		(1 << 21)
/** MCAN1_MCAN_TXBRP_TRP20 Transmission Request Pending for Buffer 20 **/
#define MCAN1_MCAN_TXBRP_TRP20		(1 << 20)
/** MCAN1_MCAN_TXBRP_TRP19 Transmission Request Pending for Buffer 19 **/
#define MCAN1_MCAN_TXBRP_TRP19		(1 << 19)
/** MCAN1_MCAN_TXBRP_TRP18 Transmission Request Pending for Buffer 18 **/
#define MCAN1_MCAN_TXBRP_TRP18		(1 << 18)
/** MCAN1_MCAN_TXBRP_TRP17 Transmission Request Pending for Buffer 17 **/
#define MCAN1_MCAN_TXBRP_TRP17		(1 << 17)
/** MCAN1_MCAN_TXBRP_TRP16 Transmission Request Pending for Buffer 16 **/
#define MCAN1_MCAN_TXBRP_TRP16		(1 << 16)
/** MCAN1_MCAN_TXBRP_TRP15 Transmission Request Pending for Buffer 15 **/
#define MCAN1_MCAN_TXBRP_TRP15		(1 << 15)
/** MCAN1_MCAN_TXBRP_TRP14 Transmission Request Pending for Buffer 14 **/
#define MCAN1_MCAN_TXBRP_TRP14		(1 << 14)
/** MCAN1_MCAN_TXBRP_TRP13 Transmission Request Pending for Buffer 13 **/
#define MCAN1_MCAN_TXBRP_TRP13		(1 << 13)
/** MCAN1_MCAN_TXBRP_TRP12 Transmission Request Pending for Buffer 12 **/
#define MCAN1_MCAN_TXBRP_TRP12		(1 << 12)
/** MCAN1_MCAN_TXBRP_TRP11 Transmission Request Pending for Buffer 11 **/
#define MCAN1_MCAN_TXBRP_TRP11		(1 << 11)
/** MCAN1_MCAN_TXBRP_TRP10 Transmission Request Pending for Buffer 10 **/
#define MCAN1_MCAN_TXBRP_TRP10		(1 << 10)
/** MCAN1_MCAN_TXBRP_TRP9 Transmission Request Pending for Buffer 9 **/
#define MCAN1_MCAN_TXBRP_TRP9		(1 << 9)
/** MCAN1_MCAN_TXBRP_TRP8 Transmission Request Pending for Buffer 8 **/
#define MCAN1_MCAN_TXBRP_TRP8		(1 << 8)
/** MCAN1_MCAN_TXBRP_TRP7 Transmission Request Pending for Buffer 7 **/
#define MCAN1_MCAN_TXBRP_TRP7		(1 << 7)
/** MCAN1_MCAN_TXBRP_TRP6 Transmission Request Pending for Buffer 6 **/
#define MCAN1_MCAN_TXBRP_TRP6		(1 << 6)
/** MCAN1_MCAN_TXBRP_TRP5 Transmission Request Pending for Buffer 5 **/
#define MCAN1_MCAN_TXBRP_TRP5		(1 << 5)
/** MCAN1_MCAN_TXBRP_TRP4 Transmission Request Pending for Buffer 4 **/
#define MCAN1_MCAN_TXBRP_TRP4		(1 << 4)
/** MCAN1_MCAN_TXBRP_TRP3 Transmission Request Pending for Buffer 3 **/
#define MCAN1_MCAN_TXBRP_TRP3		(1 << 3)
/** MCAN1_MCAN_TXBRP_TRP2 Transmission Request Pending for Buffer 2 **/
#define MCAN1_MCAN_TXBRP_TRP2		(1 << 2)
/** MCAN1_MCAN_TXBRP_TRP1 Transmission Request Pending for Buffer 1 **/
#define MCAN1_MCAN_TXBRP_TRP1		(1 << 1)
/** MCAN1_MCAN_TXBRP_TRP0 Transmission Request Pending for Buffer 0 **/
#define MCAN1_MCAN_TXBRP_TRP0		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_txbar MCANTXBAR Transmit Buffer Add Request Register
@{*/

