grevaillot/svd_tools/headers/ATSAMV71Q19/mcan1.h
/** MCAN1_MCAN_TXBAR_AR31 Add Request for Transmit Buffer 31 **/
#define MCAN1_MCAN_TXBAR_AR31		(1 << 31)
/** MCAN1_MCAN_TXBAR_AR30 Add Request for Transmit Buffer 30 **/
#define MCAN1_MCAN_TXBAR_AR30		(1 << 30)
/** MCAN1_MCAN_TXBAR_AR29 Add Request for Transmit Buffer 29 **/
#define MCAN1_MCAN_TXBAR_AR29		(1 << 29)
/** MCAN1_MCAN_TXBAR_AR28 Add Request for Transmit Buffer 28 **/
#define MCAN1_MCAN_TXBAR_AR28		(1 << 28)
/** MCAN1_MCAN_TXBAR_AR27 Add Request for Transmit Buffer 27 **/
#define MCAN1_MCAN_TXBAR_AR27		(1 << 27)
/** MCAN1_MCAN_TXBAR_AR26 Add Request for Transmit Buffer 26 **/
#define MCAN1_MCAN_TXBAR_AR26		(1 << 26)
/** MCAN1_MCAN_TXBAR_AR25 Add Request for Transmit Buffer 25 **/
#define MCAN1_MCAN_TXBAR_AR25		(1 << 25)
/** MCAN1_MCAN_TXBAR_AR24 Add Request for Transmit Buffer 24 **/
#define MCAN1_MCAN_TXBAR_AR24		(1 << 24)
/** MCAN1_MCAN_TXBAR_AR23 Add Request for Transmit Buffer 23 **/
#define MCAN1_MCAN_TXBAR_AR23		(1 << 23)
/** MCAN1_MCAN_TXBAR_AR22 Add Request for Transmit Buffer 22 **/
#define MCAN1_MCAN_TXBAR_AR22		(1 << 22)
/** MCAN1_MCAN_TXBAR_AR21 Add Request for Transmit Buffer 21 **/
#define MCAN1_MCAN_TXBAR_AR21		(1 << 21)
/** MCAN1_MCAN_TXBAR_AR20 Add Request for Transmit Buffer 20 **/
#define MCAN1_MCAN_TXBAR_AR20		(1 << 20)
/** MCAN1_MCAN_TXBAR_AR19 Add Request for Transmit Buffer 19 **/
#define MCAN1_MCAN_TXBAR_AR19		(1 << 19)
/** MCAN1_MCAN_TXBAR_AR18 Add Request for Transmit Buffer 18 **/
#define MCAN1_MCAN_TXBAR_AR18		(1 << 18)
/** MCAN1_MCAN_TXBAR_AR17 Add Request for Transmit Buffer 17 **/
#define MCAN1_MCAN_TXBAR_AR17		(1 << 17)
/** MCAN1_MCAN_TXBAR_AR16 Add Request for Transmit Buffer 16 **/
#define MCAN1_MCAN_TXBAR_AR16		(1 << 16)
/** MCAN1_MCAN_TXBAR_AR15 Add Request for Transmit Buffer 15 **/
#define MCAN1_MCAN_TXBAR_AR15		(1 << 15)
/** MCAN1_MCAN_TXBAR_AR14 Add Request for Transmit Buffer 14 **/
#define MCAN1_MCAN_TXBAR_AR14		(1 << 14)
/** MCAN1_MCAN_TXBAR_AR13 Add Request for Transmit Buffer 13 **/
#define MCAN1_MCAN_TXBAR_AR13		(1 << 13)
/** MCAN1_MCAN_TXBAR_AR12 Add Request for Transmit Buffer 12 **/
#define MCAN1_MCAN_TXBAR_AR12		(1 << 12)
/** MCAN1_MCAN_TXBAR_AR11 Add Request for Transmit Buffer 11 **/
#define MCAN1_MCAN_TXBAR_AR11		(1 << 11)
/** MCAN1_MCAN_TXBAR_AR10 Add Request for Transmit Buffer 10 **/
#define MCAN1_MCAN_TXBAR_AR10		(1 << 10)
/** MCAN1_MCAN_TXBAR_AR9 Add Request for Transmit Buffer 9 **/
#define MCAN1_MCAN_TXBAR_AR9		(1 << 9)
/** MCAN1_MCAN_TXBAR_AR8 Add Request for Transmit Buffer 8 **/
#define MCAN1_MCAN_TXBAR_AR8		(1 << 8)
/** MCAN1_MCAN_TXBAR_AR7 Add Request for Transmit Buffer 7 **/
#define MCAN1_MCAN_TXBAR_AR7		(1 << 7)
/** MCAN1_MCAN_TXBAR_AR6 Add Request for Transmit Buffer 6 **/
#define MCAN1_MCAN_TXBAR_AR6		(1 << 6)
/** MCAN1_MCAN_TXBAR_AR5 Add Request for Transmit Buffer 5 **/
#define MCAN1_MCAN_TXBAR_AR5		(1 << 5)
/** MCAN1_MCAN_TXBAR_AR4 Add Request for Transmit Buffer 4 **/
#define MCAN1_MCAN_TXBAR_AR4		(1 << 4)
/** MCAN1_MCAN_TXBAR_AR3 Add Request for Transmit Buffer 3 **/
#define MCAN1_MCAN_TXBAR_AR3		(1 << 3)
/** MCAN1_MCAN_TXBAR_AR2 Add Request for Transmit Buffer 2 **/
#define MCAN1_MCAN_TXBAR_AR2		(1 << 2)
/** MCAN1_MCAN_TXBAR_AR1 Add Request for Transmit Buffer 1 **/
#define MCAN1_MCAN_TXBAR_AR1		(1 << 1)
/** MCAN1_MCAN_TXBAR_AR0 Add Request for Transmit Buffer 0 **/
#define MCAN1_MCAN_TXBAR_AR0		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_txbcr MCANTXBCR Transmit Buffer Cancellation Request Register
@{*/

/** MCAN1_MCAN_TXBCR_CR31 Cancellation Request for Transmit Buffer 31 **/
#define MCAN1_MCAN_TXBCR_CR31		(1 << 31)
/** MCAN1_MCAN_TXBCR_CR30 Cancellation Request for Transmit Buffer 30 **/
#define MCAN1_MCAN_TXBCR_CR30		(1 << 30)
/** MCAN1_MCAN_TXBCR_CR29 Cancellation Request for Transmit Buffer 29 **/
#define MCAN1_MCAN_TXBCR_CR29		(1 << 29)
/** MCAN1_MCAN_TXBCR_CR28 Cancellation Request for Transmit Buffer 28 **/
#define MCAN1_MCAN_TXBCR_CR28		(1 << 28)
/** MCAN1_MCAN_TXBCR_CR27 Cancellation Request for Transmit Buffer 27 **/
#define MCAN1_MCAN_TXBCR_CR27		(1 << 27)
/** MCAN1_MCAN_TXBCR_CR26 Cancellation Request for Transmit Buffer 26 **/
#define MCAN1_MCAN_TXBCR_CR26		(1 << 26)
/** MCAN1_MCAN_TXBCR_CR25 Cancellation Request for Transmit Buffer 25 **/
#define MCAN1_MCAN_TXBCR_CR25		(1 << 25)
/** MCAN1_MCAN_TXBCR_CR24 Cancellation Request for Transmit Buffer 24 **/
#define MCAN1_MCAN_TXBCR_CR24		(1 << 24)
/** MCAN1_MCAN_TXBCR_CR23 Cancellation Request for Transmit Buffer 23 **/
#define MCAN1_MCAN_TXBCR_CR23		(1 << 23)
/** MCAN1_MCAN_TXBCR_CR22 Cancellation Request for Transmit Buffer 22 **/
#define MCAN1_MCAN_TXBCR_CR22		(1 << 22)
/** MCAN1_MCAN_TXBCR_CR21 Cancellation Request for Transmit Buffer 21 **/
#define MCAN1_MCAN_TXBCR_CR21		(1 << 21)
/** MCAN1_MCAN_TXBCR_CR20 Cancellation Request for Transmit Buffer 20 **/
#define MCAN1_MCAN_TXBCR_CR20		(1 << 20)
/** MCAN1_MCAN_TXBCR_CR19 Cancellation Request for Transmit Buffer 19 **/
#define MCAN1_MCAN_TXBCR_CR19		(1 << 19)
/** MCAN1_MCAN_TXBCR_CR18 Cancellation Request for Transmit Buffer 18 **/
#define MCAN1_MCAN_TXBCR_CR18		(1 << 18)
/** MCAN1_MCAN_TXBCR_CR17 Cancellation Request for Transmit Buffer 17 **/
#define MCAN1_MCAN_TXBCR_CR17		(1 << 17)
/** MCAN1_MCAN_TXBCR_CR16 Cancellation Request for Transmit Buffer 16 **/
#define MCAN1_MCAN_TXBCR_CR16		(1 << 16)
/** MCAN1_MCAN_TXBCR_CR15 Cancellation Request for Transmit Buffer 15 **/
#define MCAN1_MCAN_TXBCR_CR15		(1 << 15)
/** MCAN1_MCAN_TXBCR_CR14 Cancellation Request for Transmit Buffer 14 **/
#define MCAN1_MCAN_TXBCR_CR14		(1 << 14)
/** MCAN1_MCAN_TXBCR_CR13 Cancellation Request for Transmit Buffer 13 **/
#define MCAN1_MCAN_TXBCR_CR13		(1 << 13)
/** MCAN1_MCAN_TXBCR_CR12 Cancellation Request for Transmit Buffer 12 **/
#define MCAN1_MCAN_TXBCR_CR12		(1 << 12)
/** MCAN1_MCAN_TXBCR_CR11 Cancellation Request for Transmit Buffer 11 **/
#define MCAN1_MCAN_TXBCR_CR11		(1 << 11)
/** MCAN1_MCAN_TXBCR_CR10 Cancellation Request for Transmit Buffer 10 **/
#define MCAN1_MCAN_TXBCR_CR10		(1 << 10)
/** MCAN1_MCAN_TXBCR_CR9 Cancellation Request for Transmit Buffer 9 **/
#define MCAN1_MCAN_TXBCR_CR9		(1 << 9)
/** MCAN1_MCAN_TXBCR_CR8 Cancellation Request for Transmit Buffer 8 **/
#define MCAN1_MCAN_TXBCR_CR8		(1 << 8)
/** MCAN1_MCAN_TXBCR_CR7 Cancellation Request for Transmit Buffer 7 **/
#define MCAN1_MCAN_TXBCR_CR7		(1 << 7)
/** MCAN1_MCAN_TXBCR_CR6 Cancellation Request for Transmit Buffer 6 **/
#define MCAN1_MCAN_TXBCR_CR6		(1 << 6)
/** MCAN1_MCAN_TXBCR_CR5 Cancellation Request for Transmit Buffer 5 **/
#define MCAN1_MCAN_TXBCR_CR5		(1 << 5)
/** MCAN1_MCAN_TXBCR_CR4 Cancellation Request for Transmit Buffer 4 **/
#define MCAN1_MCAN_TXBCR_CR4		(1 << 4)
/** MCAN1_MCAN_TXBCR_CR3 Cancellation Request for Transmit Buffer 3 **/
#define MCAN1_MCAN_TXBCR_CR3		(1 << 3)
/** MCAN1_MCAN_TXBCR_CR2 Cancellation Request for Transmit Buffer 2 **/
#define MCAN1_MCAN_TXBCR_CR2		(1 << 2)
/** MCAN1_MCAN_TXBCR_CR1 Cancellation Request for Transmit Buffer 1 **/
#define MCAN1_MCAN_TXBCR_CR1		(1 << 1)
/** MCAN1_MCAN_TXBCR_CR0 Cancellation Request for Transmit Buffer 0 **/
#define MCAN1_MCAN_TXBCR_CR0		(1 << 0)

/**@}*/

