grevaillot/svd_tools/headers/ATSAMV71Q19/mcan1.h
/** @defgroup mcan1_mcan_txbto MCANTXBTO Transmit Buffer Transmission Occurred Register
@{*/

/** MCAN1_MCAN_TXBTO_TO31 Transmission Occurred for Buffer 31 **/
#define MCAN1_MCAN_TXBTO_TO31		(1 << 31)
/** MCAN1_MCAN_TXBTO_TO30 Transmission Occurred for Buffer 30 **/
#define MCAN1_MCAN_TXBTO_TO30		(1 << 30)
/** MCAN1_MCAN_TXBTO_TO29 Transmission Occurred for Buffer 29 **/
#define MCAN1_MCAN_TXBTO_TO29		(1 << 29)
/** MCAN1_MCAN_TXBTO_TO28 Transmission Occurred for Buffer 28 **/
#define MCAN1_MCAN_TXBTO_TO28		(1 << 28)
/** MCAN1_MCAN_TXBTO_TO27 Transmission Occurred for Buffer 27 **/
#define MCAN1_MCAN_TXBTO_TO27		(1 << 27)
/** MCAN1_MCAN_TXBTO_TO26 Transmission Occurred for Buffer 26 **/
#define MCAN1_MCAN_TXBTO_TO26		(1 << 26)
/** MCAN1_MCAN_TXBTO_TO25 Transmission Occurred for Buffer 25 **/
#define MCAN1_MCAN_TXBTO_TO25		(1 << 25)
/** MCAN1_MCAN_TXBTO_TO24 Transmission Occurred for Buffer 24 **/
#define MCAN1_MCAN_TXBTO_TO24		(1 << 24)
/** MCAN1_MCAN_TXBTO_TO23 Transmission Occurred for Buffer 23 **/
#define MCAN1_MCAN_TXBTO_TO23		(1 << 23)
/** MCAN1_MCAN_TXBTO_TO22 Transmission Occurred for Buffer 22 **/
#define MCAN1_MCAN_TXBTO_TO22		(1 << 22)
/** MCAN1_MCAN_TXBTO_TO21 Transmission Occurred for Buffer 21 **/
#define MCAN1_MCAN_TXBTO_TO21		(1 << 21)
/** MCAN1_MCAN_TXBTO_TO20 Transmission Occurred for Buffer 20 **/
#define MCAN1_MCAN_TXBTO_TO20		(1 << 20)
/** MCAN1_MCAN_TXBTO_TO19 Transmission Occurred for Buffer 19 **/
#define MCAN1_MCAN_TXBTO_TO19		(1 << 19)
/** MCAN1_MCAN_TXBTO_TO18 Transmission Occurred for Buffer 18 **/
#define MCAN1_MCAN_TXBTO_TO18		(1 << 18)
/** MCAN1_MCAN_TXBTO_TO17 Transmission Occurred for Buffer 17 **/
#define MCAN1_MCAN_TXBTO_TO17		(1 << 17)
/** MCAN1_MCAN_TXBTO_TO16 Transmission Occurred for Buffer 16 **/
#define MCAN1_MCAN_TXBTO_TO16		(1 << 16)
/** MCAN1_MCAN_TXBTO_TO15 Transmission Occurred for Buffer 15 **/
#define MCAN1_MCAN_TXBTO_TO15		(1 << 15)
/** MCAN1_MCAN_TXBTO_TO14 Transmission Occurred for Buffer 14 **/
#define MCAN1_MCAN_TXBTO_TO14		(1 << 14)
/** MCAN1_MCAN_TXBTO_TO13 Transmission Occurred for Buffer 13 **/
#define MCAN1_MCAN_TXBTO_TO13		(1 << 13)
/** MCAN1_MCAN_TXBTO_TO12 Transmission Occurred for Buffer 12 **/
#define MCAN1_MCAN_TXBTO_TO12		(1 << 12)
/** MCAN1_MCAN_TXBTO_TO11 Transmission Occurred for Buffer 11 **/
#define MCAN1_MCAN_TXBTO_TO11		(1 << 11)
/** MCAN1_MCAN_TXBTO_TO10 Transmission Occurred for Buffer 10 **/
#define MCAN1_MCAN_TXBTO_TO10		(1 << 10)
/** MCAN1_MCAN_TXBTO_TO9 Transmission Occurred for Buffer 9 **/
#define MCAN1_MCAN_TXBTO_TO9		(1 << 9)
/** MCAN1_MCAN_TXBTO_TO8 Transmission Occurred for Buffer 8 **/
#define MCAN1_MCAN_TXBTO_TO8		(1 << 8)
/** MCAN1_MCAN_TXBTO_TO7 Transmission Occurred for Buffer 7 **/
#define MCAN1_MCAN_TXBTO_TO7		(1 << 7)
/** MCAN1_MCAN_TXBTO_TO6 Transmission Occurred for Buffer 6 **/
#define MCAN1_MCAN_TXBTO_TO6		(1 << 6)
/** MCAN1_MCAN_TXBTO_TO5 Transmission Occurred for Buffer 5 **/
#define MCAN1_MCAN_TXBTO_TO5		(1 << 5)
/** MCAN1_MCAN_TXBTO_TO4 Transmission Occurred for Buffer 4 **/
#define MCAN1_MCAN_TXBTO_TO4		(1 << 4)
/** MCAN1_MCAN_TXBTO_TO3 Transmission Occurred for Buffer 3 **/
#define MCAN1_MCAN_TXBTO_TO3		(1 << 3)
/** MCAN1_MCAN_TXBTO_TO2 Transmission Occurred for Buffer 2 **/
#define MCAN1_MCAN_TXBTO_TO2		(1 << 2)
/** MCAN1_MCAN_TXBTO_TO1 Transmission Occurred for Buffer 1 **/
#define MCAN1_MCAN_TXBTO_TO1		(1 << 1)
/** MCAN1_MCAN_TXBTO_TO0 Transmission Occurred for Buffer 0 **/
#define MCAN1_MCAN_TXBTO_TO0		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_txbcf MCANTXBCF Transmit Buffer Cancellation Finished Register
@{*/

/** MCAN1_MCAN_TXBCF_CF31 Cancellation Finished for Transmit Buffer 31 **/
#define MCAN1_MCAN_TXBCF_CF31		(1 << 31)
/** MCAN1_MCAN_TXBCF_CF30 Cancellation Finished for Transmit Buffer 30 **/
#define MCAN1_MCAN_TXBCF_CF30		(1 << 30)
/** MCAN1_MCAN_TXBCF_CF29 Cancellation Finished for Transmit Buffer 29 **/
#define MCAN1_MCAN_TXBCF_CF29		(1 << 29)
/** MCAN1_MCAN_TXBCF_CF28 Cancellation Finished for Transmit Buffer 28 **/
#define MCAN1_MCAN_TXBCF_CF28		(1 << 28)
/** MCAN1_MCAN_TXBCF_CF27 Cancellation Finished for Transmit Buffer 27 **/
#define MCAN1_MCAN_TXBCF_CF27		(1 << 27)
/** MCAN1_MCAN_TXBCF_CF26 Cancellation Finished for Transmit Buffer 26 **/
#define MCAN1_MCAN_TXBCF_CF26		(1 << 26)
/** MCAN1_MCAN_TXBCF_CF25 Cancellation Finished for Transmit Buffer 25 **/
#define MCAN1_MCAN_TXBCF_CF25		(1 << 25)
/** MCAN1_MCAN_TXBCF_CF24 Cancellation Finished for Transmit Buffer 24 **/
#define MCAN1_MCAN_TXBCF_CF24		(1 << 24)
/** MCAN1_MCAN_TXBCF_CF23 Cancellation Finished for Transmit Buffer 23 **/
#define MCAN1_MCAN_TXBCF_CF23		(1 << 23)
/** MCAN1_MCAN_TXBCF_CF22 Cancellation Finished for Transmit Buffer 22 **/
#define MCAN1_MCAN_TXBCF_CF22		(1 << 22)
/** MCAN1_MCAN_TXBCF_CF21 Cancellation Finished for Transmit Buffer 21 **/
#define MCAN1_MCAN_TXBCF_CF21		(1 << 21)
/** MCAN1_MCAN_TXBCF_CF20 Cancellation Finished for Transmit Buffer 20 **/
#define MCAN1_MCAN_TXBCF_CF20		(1 << 20)
/** MCAN1_MCAN_TXBCF_CF19 Cancellation Finished for Transmit Buffer 19 **/
#define MCAN1_MCAN_TXBCF_CF19		(1 << 19)
/** MCAN1_MCAN_TXBCF_CF18 Cancellation Finished for Transmit Buffer 18 **/
#define MCAN1_MCAN_TXBCF_CF18		(1 << 18)
/** MCAN1_MCAN_TXBCF_CF17 Cancellation Finished for Transmit Buffer 17 **/
#define MCAN1_MCAN_TXBCF_CF17		(1 << 17)
/** MCAN1_MCAN_TXBCF_CF16 Cancellation Finished for Transmit Buffer 16 **/
#define MCAN1_MCAN_TXBCF_CF16		(1 << 16)
/** MCAN1_MCAN_TXBCF_CF15 Cancellation Finished for Transmit Buffer 15 **/
#define MCAN1_MCAN_TXBCF_CF15		(1 << 15)
/** MCAN1_MCAN_TXBCF_CF14 Cancellation Finished for Transmit Buffer 14 **/
#define MCAN1_MCAN_TXBCF_CF14		(1 << 14)
/** MCAN1_MCAN_TXBCF_CF13 Cancellation Finished for Transmit Buffer 13 **/
#define MCAN1_MCAN_TXBCF_CF13		(1 << 13)
/** MCAN1_MCAN_TXBCF_CF12 Cancellation Finished for Transmit Buffer 12 **/
#define MCAN1_MCAN_TXBCF_CF12		(1 << 12)
/** MCAN1_MCAN_TXBCF_CF11 Cancellation Finished for Transmit Buffer 11 **/
#define MCAN1_MCAN_TXBCF_CF11		(1 << 11)
/** MCAN1_MCAN_TXBCF_CF10 Cancellation Finished for Transmit Buffer 10 **/
#define MCAN1_MCAN_TXBCF_CF10		(1 << 10)
/** MCAN1_MCAN_TXBCF_CF9 Cancellation Finished for Transmit Buffer 9 **/
#define MCAN1_MCAN_TXBCF_CF9		(1 << 9)
/** MCAN1_MCAN_TXBCF_CF8 Cancellation Finished for Transmit Buffer 8 **/
#define MCAN1_MCAN_TXBCF_CF8		(1 << 8)
/** MCAN1_MCAN_TXBCF_CF7 Cancellation Finished for Transmit Buffer 7 **/
#define MCAN1_MCAN_TXBCF_CF7		(1 << 7)
/** MCAN1_MCAN_TXBCF_CF6 Cancellation Finished for Transmit Buffer 6 **/
#define MCAN1_MCAN_TXBCF_CF6		(1 << 6)
/** MCAN1_MCAN_TXBCF_CF5 Cancellation Finished for Transmit Buffer 5 **/
#define MCAN1_MCAN_TXBCF_CF5		(1 << 5)
/** MCAN1_MCAN_TXBCF_CF4 Cancellation Finished for Transmit Buffer 4 **/
#define MCAN1_MCAN_TXBCF_CF4		(1 << 4)
/** MCAN1_MCAN_TXBCF_CF3 Cancellation Finished for Transmit Buffer 3 **/
#define MCAN1_MCAN_TXBCF_CF3		(1 << 3)
/** MCAN1_MCAN_TXBCF_CF2 Cancellation Finished for Transmit Buffer 2 **/
#define MCAN1_MCAN_TXBCF_CF2		(1 << 2)
/** MCAN1_MCAN_TXBCF_CF1 Cancellation Finished for Transmit Buffer 1 **/
#define MCAN1_MCAN_TXBCF_CF1		(1 << 1)
/** MCAN1_MCAN_TXBCF_CF0 Cancellation Finished for Transmit Buffer 0 **/
#define MCAN1_MCAN_TXBCF_CF0		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_txbtie MCANTXBTIE Transmit Buffer Transmission Interrupt Enable Register
@{*/

